%% 获取从根关节到足端位置的变换矩阵（新版model），注意只有位置，没有姿态
%这里的基坐标系与根关节角度为0时候的根关节坐标系一致，这个基坐标系和base坐标系差一个固定的平移量0.4,和转动量（腿1->120°,腿2->180°...）
%t1-根关节角度，%t2-髋关节角度，%t3-膝关节角度
% a2=90°，L1=0.18m，L2=0.5m，L3=0.5m
syms t1 t2 t3 a2 L1 L2 L3
T_0_1 = DH2T(0,0,0,t1);
T_1_2 = subs(DH2T(a2,L1,0,t2),a2,pi/2);
C_T_2_3 = subs(DH2T(sym(0),L2,sym(0),t3),t3,-pi/2); %先绕着z转动-90°，平移
T_2_3 = C_T_2_3 * DH2T(0,0,0,t3);   %再考虑关节角度t3
T_3_4 =  DH2T(sym(0),L3,0,sym(0));  %只有位置没有姿态

T = simplify(T_0_1 * T_1_2 * T_2_3 * T_3_4)
% T = subs(T,{L1,L2,L3},{0.18,0.5,0.5})
subs(T,{t1,t2,t3},{0,0,0})
%% 计算Jacobian
P = T(1:3,4);
J11 = diff(P(1),t1);
J12 = diff(P(1),t2);
J13 = diff(P(1),t3);

J21 = diff(P(2),t1);
J22 = diff(P(2),t2);
J23 = diff(P(2),t3);

J31 = diff(P(3),t1);
J32 = diff(P(3),t2);
J33 = diff(P(3),t3);
J = [J11,J12,J13;J21,J22,J23;J31,J32,J33]

%%  测试雅克比的正确性
%固定t2,t3，旋转t1
J1 = subs(J,{t1,t2,t3},{0,0,0});
v1 = J1 * [1,0,0]'  %通过
%固定t1,t3，旋转t2
J2 = subs(J,{t1,t2,t3},{0,0,0});
v2 = J2 * [0,1,0]'  %通过
%固定t1,t2，旋转t3
J3 = subs(J,{t1,t2,t3},{0,0,0});
v3 = J3 * [0,0,1]'  %通过
%同时转动t1,t2,t3
J4 = subs(J,{t1,t2,t3},{0,0,0});
v4 = J4 * [1,1,1]'  %通过
v4 == (v1+v2+v3)